[{"title":"You've Got to Find What You Love","date":"2019-07-28T13:15:06.000Z","updated":"2019-07-28T16:07:50.860Z","content":"I am honored to be with you today at your commencement from one of the finest universities in the world. I never graduated from college. Truth be told, this is the closest I’ve ever gotten to a college graduation. Today I want to tell you three stories from my life. That’s it. No big deal. Just three stories.\nThe first story is about connecting the dots.I  dropped out of Reed College after the first 6 months, but then stayed  around as a drop-in for another 18 months or so before I really quit. So  why did I drop out?\nIt started before I was born. My biological mother was a young, unwed  college graduate student, and she decided to put me up for adoption.  She felt very strongly that I should be adopted by college graduates, so  everything was all set for me to be adopted at birth by a lawyer and  his wife. Except that when I popped out they decided at the last minute  that they really wanted a girl. So my parents, who were on a waiting  list, got a call in the middle of the night asking: “We have an  unexpected baby boy; do you want him?” They said: “Of course.” My  biological mother later found out that my mother had never graduated  from college and that my father had never graduated from high school.  She refused to sign the final adoption papers. She only relented a few  months later when my parents promised that I would someday go to  college.\nAnd 17 years later I did go to college. But I naively chose a college  that was almost as expensive as Stanford, and all of my working-class  parents’ savings were being spent on my college tuition. After six  months, I couldn’t see the value in it. I had no idea what I wanted to  do with my life and no idea how college was going to help me figure it  out. And here I was spending all of the money my parents had saved their  entire life. So I decided to drop out and trust that it would all work  out OK. It was pretty scary at the time, but looking back it was one of  the best decisions I ever made. The minute I dropped out I could stop  taking the required classes that didn’t interest me, and begin dropping  in on the ones that looked interesting.\nIt wasn’t all romantic. I didn’t have a dorm room, so I slept on the  floor in friends’ rooms, I returned Coke bottles for the 5? deposits to  buy food with, and I would walk the 7 miles across town every Sunday  night to get one good meal a week at the Hare Krishna temple. I loved  it. And much of what I stumbled into by following my curiosity and  intuition turned out to be priceless later on. Let me give you one  example:\nReed College at that time offered perhaps the best calligraphy  instruction in the country. Throughout the campus every poster, every  label on every drawer, was beautifully hand calligraphed. Because I had  dropped out and didn’t have to take the normal classes, I decided to  take a calligraphy class to learn how to do this. I learned about serif  and sans serif typefaces, about varying the amount of space between  different letter combinations, about what makes great typography great.  It was beautiful, historical, artistically subtle in a way that science  can’t capture, and I found it fascinating.\nNone of this had even a hope of any practical application in my life.  But 10 years later, when we were designing the first Macintosh  computer, it all came back to me. And we designed it all into the Mac.  It was the first computer with beautiful typography. If I had never  dropped in on that single course in college, the Mac would have never  had multiple typefaces or proportionally spaced fonts. And since Windows  just copied the Mac, it’s likely that no personal computer would have  them. If I had never dropped out, I would have never dropped in on this  calligraphy class, and personal computers might not have the wonderful  typography that they do. Of course it was impossible to connect the dots  looking forward when I was in college. But it was very, very clear  looking backward 10 years later.\nAgain, you can’t connect the dots looking forward; you can only  connect them looking backward. So you have to trust that the dots will  somehow connect in your future. You have to trust in something — your  gut, destiny, life, karma, whatever. This approach has never let me  down, and it has made all the difference in my life.\nMy second story is about love and loss.I  was lucky — I found what I loved to do early in life. Woz and I started  Apple in my parents’ garage when I was 20. We worked hard, and in 10  years Apple had grown from just the two of us in a garage into a $2  billion company with over 4,000 employees. We had just released our  finest creation — the Macintosh — a year earlier, and I had just turned  30. And then I got fired. How can you get fired from a company you  started? Well, as Apple grew we hired someone who I thought was very  talented to run the company with me, and for the first year or so things  went well. But then our visions of the future began to diverge and  eventually we had a falling out. When we did, our Board of Directors  sided with him. So at 30 I was out. And very publicly out. What had been  the focus of my entire adult life was gone, and it was devastating.\nI really didn’t know what to do for a few months. I felt that I had  let the previous generation of entrepreneurs down — that I had dropped  the baton as it was being passed to me. I met with David Packard and Bob  Noyce and tried to apologize for screwing up so badly. I was a very  public failure, and I even thought about running away from the valley.  But something slowly began to dawn on me — I still loved what I did. The  turn of events at Apple had not changed that one bit. I had been  rejected, but I was still in love. And so I decided to start over.\nI didn’t see it then, but it turned out that getting fired from Apple  was the best thing that could have ever happened to me. The heaviness  of being successful was replaced by the lightness of being a beginner  again, less sure about everything. It freed me to enter one of the most  creative periods of my life.\nDuring the next five years, I started a company named NeXT, another  company named Pixar, and fell in love with an amazing woman who would  become my wife. Pixar went on to create the world’s first computer  animated feature film, Toy Story, and is now the most successful  animation studio in the world. In a remarkable turn of events, Apple  bought NeXT, I returned to Apple, and the technology we developed at  NeXT is at the heart of Apple’s current renaissance. And Laurene and I  have a wonderful family together.\nI’m pretty sure none of this would have happened if I hadn’t been  fired from Apple. It was awful tasting medicine, but I guess the patient  needed it. Sometimes life hits you in the head with a brick. Don’t lose  faith. I’m convinced that the only thing that kept me going was that I  loved what I did. You’ve got to find what you love. And that is as true  for your work as it is for your lovers. Your work is going to fill a  large part of your life, and the only way to be truly satisfied is to do  what you believe is great work. And the only way to do great work is to  love what you do. If you haven’t found it yet, keep looking. Don’t  settle. As with all matters of the heart, you’ll know when you find it.  And, like any great relationship, it just gets better and better as the  years roll on. So keep looking until you find it. Don’t settle.\nMy third story is about death.When  I was 17, I read a quote that went something like: “If you live each  day as if it was your last, someday you’ll most certainly be right.” It  made an impression on me, and since then, for the past 33 years, I have  looked in the mirror every morning and asked myself: “If today were the  last day of my life, would I want to do what I am about to do today?”  And whenever the answer has been “No” for too many days in a row, I know  I need to change something.\nRemembering that I’ll be dead soon is the most important tool I’ve  ever encountered to help me make the big choices in life. Because almost  everything — all external expectations, all pride, all fear of  embarrassment or failure — these things just fall away in the face of  death, leaving only what is truly important. Remembering that you are  going to die is the best way I know to avoid the trap of thinking you  have something to lose. You are already naked. There is no reason not to  follow your heart.\nAbout a year ago I was diagnosed with cancer. I had a scan at 7:30 in  the morning, and it clearly showed a tumor on my pancreas. I didn’t  even know what a pancreas was. The doctors told me this was almost  certainly a type of cancer that is incurable, and that I should expect  to live no longer than three to six months. My doctor advised me to go  home and get my affairs in order, which is doctor’s code for prepare to  die. It means to try to tell your kids everything you thought you’d have  the next 10 years to tell them in just a few months. It means to make  sure everything is buttoned up so that it will be as easy as possible  for your family. It means to say your goodbyes.\nI lived with that diagnosis all day. Later that evening I had a  biopsy, where they stuck an endoscope down my throat, through my stomach  and into my intestines, put a needle into my pancreas and got a few  cells from the tumor. I was sedated, but my wife, who was there, told me  that when they viewed the cells under a microscope the doctors started  crying because it turned out to be a very rare form of pancreatic cancer  that is curable with surgery. I had the surgery and I’m fine now.\nThis was the closest I’ve been to facing death, and I hope it’s the  closest I get for a few more decades. Having lived through it, I can now  say this to you with a bit more certainty than when death was a useful  but purely intellectual concept:\nNo one wants to die. Even people who want to go to heaven don’t want  to die to get there. And yet death is the destination we all share. No  one has ever escaped it. And that is as it should be, because Death is  very likely the single best invention of Life. It is Life’s change  agent. It clears out the old to make way for the new. Right now the new  is you, but someday not too long from now, you will gradually become the  old and be cleared away. Sorry to be so dramatic, but it is quite true.\nYour time is limited, so don’t waste it living someone else’s life.  Don’t be trapped by dogma — which is living with the results of other  people’s thinking. Don’t let the noise of others’ opinions drown out  your own inner voice. And most important, have the courage to follow  your heart and intuition. They somehow already know what you truly want  to become. Everything else is secondary.\nWhen I was young, there was an amazing publication called The Whole  Earth Catalog, which was one of the bibles of my generation. It was  created by a fellow named Stewart Brand not far from here in Menlo Park,  and he brought it to life with his poetic touch. This was in the late  1960s, before personal computers and desktop publishing, so it was all  made with typewriters, scissors and Polaroid cameras. It was sort of  like Google in paperback form, 35 years before Google came along: It was  idealistic, and overflowing with neat tools and great notions.\nStewart and his team put out several issues of The Whole Earth  Catalog, and then when it had run its course, they put out a final  issue. It was the mid-1970s, and I was your age. On the back cover of  their final issue was a photograph of an early morning country road, the  kind you might find yourself hitchhiking on if you were so adventurous.  Beneath it were the words: “Stay Hungry. Stay Foolish.” It was their  farewell message as they signed off. Stay Hungry. Stay Foolish. And I  have always wished that for myself. And now, as you graduate to begin  anew, I wish that for you.\nStay Hungry. Stay Foolish.Thank you all very much.原文拷贝自Elmore’blog\n","thumbnail":"https://i.loli.net/2019/07/28/5d3dc5e1f0acc24317.jpg","plink":"https://gmahsm.github.io/post/You've Got to Find What You Love/"},{"title":"排序测试2","date":"2019-07-28T16:13:50.477Z","updated":"2019-07-28T16:08:48.942Z","content":"排序测试\n","plink":"https://gmahsm.github.io/post/排序测试2/"},{"title":"排序测试","date":"2019-07-28T16:09:02.994Z","updated":"2019-07-28T16:08:48.942Z","content":"排序测试\n","plink":"https://gmahsm.github.io/post/排序测试/"},{"title":"【Hexo博客攻略】(2).Inside主题配置","date":"2019-07-27T23:19:31.000Z","updated":"2019-07-28T11:19:03.806Z","content":"这次安装的主题是 inside，你也可以选择一个自己喜欢的主题，配置过程大同小异\n\n\n下载主题下载地址：https://github.com/ikeq/hexo-theme-inside\n使用主题我下载的是zip压缩包\n\n解压并重命名主题为 inside\n打开主题文件夹，找到_config.yml 文件，该文件为站点配置文件\n打开_config.yml 文件，将主题修改为 inside。theme: inside（这里配置的主题名一定要和主题文件的名称完全一致）\n\n配置主题主题配置文档：https://blog.oniuo.com/theme-inside\n\n官方的配置文档非常详细，按照自己的喜好一步步操作就可以\n\n部署到服务器cd到blog文件夹下，执行如下命令\n1hexo d -g","plink":"https://gmahsm.github.io/post/【Hexo博客攻略】(2).Inside主题配置/"},{"title":"用Typora写Markdownn","date":"2019-07-27T05:23:27.000Z","updated":"2019-07-28T12:34:13.624Z","content":"电脑系统windows，内容主要是Markdown语法和软件快捷键，常用整理\nMarkdown ：是一种轻量级标记语言，它允许人们使用易读易写的纯文本格式编写文档。\nTypora：markdown编辑器。官网：https://www.typora.io\n\n\n语法与快捷键汇总生成目录1[toc] + enter\n\n标题123456# 一阶标题  或者快捷键Ctrl+1## 二阶标题 或者快捷键Ctrl+2### 三阶标题    或者快捷键Ctrl+3#### 四阶标题   或者快捷键Ctrl+4##### 五阶标题  或者快捷键Ctrl+5###### 六阶标题 或者快捷键Ctrl+6\n\n下划线1&lt;u&gt;下划线的内容&lt;/u&gt; 或者快捷键Ctrl+U\n\n斜体12*倾斜内容*_倾斜内容_    或按快捷键Ctrl+I\n\n加粗12**加粗内容**__加粗内容__    或按快捷键Ctrl+B\n\n加粗斜体12***加粗内容***___加粗内容___\n\n删除线1~~删除线的内容~~  或按快捷键Alt+Shift+5\n\n==文字高亮==1==我是最重要的==\n\n角标^1^ 角标21x^2^  上角标   H~2~O  下角标    不是Markdown语法\n\n文本居中1&lt;center&gt;这是要居中的文本内容&lt;/center&gt;\n\n引用1&gt;+空格    或按快捷键ctrl + shift + q\n\n分割线12***+回车  ---+回车    个人习惯“减号”\n\n有序列表1数字+英文小数点(.)+空格\n\n无序列表1+ 、- 、* 创建无序列   个人习惯“减号”\n\n代码片段1`代码内容`\n\n代码块1​```+回车    或者快捷键Ctrl+Shift+K\n\n超链接12345673种样式[百度][https://www.baidu.com/]    或者快捷键Ctrl+K     使用频率高[CSDN][CSDN网址][CSDN网址]:https://www.csdn.net/&lt;https://github.com/&gt;\n\n图片1![图片名](网络地址)\n\n表格1234|  表头   | 表头  ||  ----  | ----  || 单元格  | 单元格 || 单元格  | 单元格 |    或者快捷键Ctrl+T\n\n注脚12Typora[^1][^1]:A markdown editor\n\n任务列表123-[ ] 抽烟-[x] 喝酒-[ ] 烫头\n\n符号输入123456789101112\\\\   反斜线\\`   反引号\\*   星号\\_   底线\\&#123; \\&#125;  花括号\\[ \\]  方括号\\( \\)  括弧\\#   井字号\\+   加号\\-   减号\\.   英文句点\\!   惊叹号\n\n特殊符号1234567891011121314151617181920&amp;copy;      版权      &amp;reg;       注册商标&amp;trade;     商标&amp;nbsp;      空格&amp;amp;       和号&amp;quot;      引号&amp;apos;      撇号&amp;lt;        小于号&amp;gt;        大于号&amp;ne;        不等号&amp;le;        小于等于&amp;ge;        大于等于&amp;cent;      分&amp;pound;     磅&amp;euro;      欧元&amp;yen;       元&amp;sect;      节&amp;times;     乘号&amp;divide;    除号&amp;plusmn;    正负号\n\n参考-感谢Typora-书写即为美学\nMarkdown 教程\n","plink":"https://gmahsm.github.io/post/用Typora写Markdownn/"},{"title":"博客图片不显示","date":"2019-07-24T23:25:12.000Z","updated":"2019-07-28T12:57:49.435Z","content":"为什么图片不显示了？\n本地使用Markdown编辑博客时，图片的引用使用的是本地相对地址。因为图片一直存放在本地的某个文件夹，所以将博客部署到github后引用地址找不到图片文件。\n\n\n有两种解决方法：\n\n配置Hexo\n使用图床工具\n\n配置Hexo\n将hexo配置文件_config.yml 中post_asset_folder设置成true。\n\n这是Hexo的资源文件夹功能，默认是关闭的。设置完成后，再次新建文件时，Hexo会自动建立一个与文章同名的文件夹，可以把与该文章相关的所有资源都放到那个文件夹，\n\n\n安装一个图片插件，\n 在hexo的目录下执行下面命令\n\n\n1npm install https://github.com/CodeFalling/hexo-asset-image --save\n\n​        效果如下图：\n\n\n博客插入图片方式\n\n![图片标题](文章同名文件夹/图片名称.jpg)\n使用图床工具\n下载图床工具 PicGo\n\n设置picgo\n\n设置链接格式，方便插入\n\n\n设置图床，第一次使用直接使用默认的sm.ms即可\n\n\n\n\n使用picgo\n\n找到要插入的图片 Ctrl+C （复制图片）\n上传图片到图床 Ctrl+Shift+P （默认快捷键，自定义快捷键方法请查看官方文档）\n在文章中插入图片 Ctrl+V （工具会以上面设置的链接格式输出到文档\n\n 注意：\n\n方法适用于单张图片的上传、使用。\n批量上传图片可以选中多张图片后拖到上传区，但使用图片需要在工具相册中找到图片并复制图片链接再插入到文章    \n\n\n\n\n更详细的配置和使用可以查看官方配置文档\n\n最后说经过使用发现，方法一缺点很明显：大量占用github pages空间。用《使用hexo-github搭建个人博客》和《博客图片不显示》两篇文做设置对比，使用方法一占用github空间 5.5M，而使用方法二仅占用github空间 390K。面对有限的github pages免费空间，方法二优势是碾压的。\n​    \n","plink":"https://gmahsm.github.io/post/博客图片不显示/"},{"title":"【Hexo博客攻略】(1).基于hexo-github环境搭建","date":"2019-07-24T16:04:43.000Z","updated":"2019-07-28T11:19:15.543Z","content":"注册账号地址：https://github.com\n创建GitHub page\ngithub page的域名形式是固定的\n\n测试\n安装git for windows下载地址：https://gitforwindows.org/。或者搜索 “git for win“\n\n默认选项安装即可安装路径根据自己使用习惯设置\n测试在命令行窗口输入 git 命令，如下图所示即为安装成功\n\n安装node.js下载地址：https://nodejs.org/en/。或者百度搜索 “node.js”\n下载左面的稳定版本\n\n默认选项安装即可安装路径根据自己使用习惯设置\n测试在命令行窗口使用”node -v”命令，显示版本号表示安装成功。如下图\n\nhexo本地使用地址：https://hexo.io/zh-cn/。或者百度搜索&quot;hexo&quot;，即可搜索到安装指令。\n\n安装在d盘新建文件夹’blog’(用户自定义)，使用命令行进入blog文件夹\n12345$  npm install hexo-cli -g    安装hexo$  hexo init blog             初始化该文件夹$  cd blog                    进入初始化完成的文件夹$  npm install\t\t\t\t   安装依赖（所需要的组件）$  hexo s             开启服务器（默认端口：4000，如果端口冲突可以使用 hexo s -p xxx自定义端口\n\n按照顺序依次执行上面指令。完成后访问localhost:4000(端口)。访问到页面表示安装成功。\n参照\n\n成功后访问页面\n将Hexo与github page联系起来git bash：在windows系统下使用git命令的模拟终端（windows自带的cmd功能太弱)\n\n进入blog文件夹，右键，Git Base Here，然后执行登录命令\n\n 12git config --global user.name &quot;用户名&quot;git config --global user.email &quot;邮箱&quot;\n\n\n在命令行或终端中使用下面的命令设置git自己的名字和电子邮件。这是因为Git是分布式版本控制系统，所以，每个机器都必须自报家门：你的名字和Email地址。\n\n效果如下：\n\n本地git与github之间需要通过ssh密钥来连接，需先生成一个密钥，命令如下：\n\n1ssh-keygen -t rsa -C &quot;邮箱&quot;\n\n\n 中间会遇到停顿 ，输入“回车”默认即可，（参考链接：ssh代理详解）\n\n\n\n进入文件夹C:\\Users\\Administrator.ssh，会看到得到的两个文件：\n\n\n\nid_rsa是私钥， id_rsa.pub是密钥\n\n\nssh代理\n\n12eval &quot;$(ssh-agent -s)&quot;\t启动ssh代理ssh-agentssh-add ~/.ssh/id_rsa\t将私钥添加到ssh代理\n\n\nssh代理是一个程序，它可以帮助我们管理私钥，ssh- agent即为ssh代理程序那么什么时候需要ssh代理帮助我们管理私钥呢？当遇到如下情况时，我们会需要ssh代理。    1、不用到处部署私钥使用不同的密钥连接到不同的主机时，需要手动指定对应的密钥，ssh代理可以帮助我们选择对应的密钥进行认证，不用手动指定密钥即可进行连接。    2、不用重复输入密码 当私钥设置了密码，我们又需要频繁的使用私钥进行认证时，ssh代理可以帮助我们免去重复的输入密码的操作。\n\n\n登陆github，点击头像下的settings，添加ssh:\n\n\n\n新建new ssh key，将id_rsa.pub(记事本打开即可)文件里的内容复制进去：\n\n\n\n执行以下指令，测试添加ssh是否成功\n\n1ssh -T git@github.com\n\n​    看到红框标注是自己的用户名表示添加成功\n\n\n进入blog文件夹，找到_config.yml配置文件，修改下面两处\n\n\n\n\n yml对缩进和空格要求很严格，每个英文冒号后面必须有一个空格，该缩进的地方必须要有缩进（比如图2的后三行代码）：\n\n\n创建博客\n  直接使用Markdown编辑器编辑文章，然后存入blog文件夹下的source_posts文件夹；\n 然后执行以下命令\n\n\n12npm install hexo-deployer-git --save\t\t安装hexo-deployer-git扩展插件 hexo d -g\t\t生成静态页面并部署到github上\n\n浏览器访问http://用户名.github.io\n参考链接：hexo官方文档\n搭建步骤参考\nssh代理详解\n","plink":"https://gmahsm.github.io/post/【Hexo博客攻略】(1).基于hexo-github环境搭建/"}]